# Join Practice

We will make use of the employee database for this assignment.  You will get lots of practice with joins and natural joins.  You only have to provide your answer in SQL, but you may find it useful to draw out the relational algebra to help you organize your thinking.

### Due:  Friday December 4

In [2]:
import warnings
warnings.filterwarnings('ignore')
from sols3 import *

In [3]:
%load_ext sql

In [4]:
%sql postgresql://vannjo02:@localhost/employees

'Connected: vannjo02@employees'

### 1. List the first and last name and hire date of each employee in the Sales Department hired before Feb 7, 1985 ordered by hire date

In [9]:
%%sql

select first_name, last_name, hire_date from employees 
natural join dept_emp natural join departments
where hire_date < '1985-02-07' and dept_name = 'Sales'
order by hire_date;

80 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1)),
 ('Adil', 'Furedi', datetime.date(1985, 2, 1)),
 ('Shir', 'Munck', datetime.date(1985, 2, 1)),
 ('Yongdong', 'Pileggi', datetime.date(1985, 2, 1)),
 ('Guenter', 'Tanemo', datetime.date(1985, 2, 2)),
 ('Erzsebet', 'Schwartzbauer', datetime.date(1985, 2, 2)),
 ('Kousuke', 'Swist', datetime.date(1985, 2, 2)),
 ('Chaosheng', 'Sommen', datetime.date(1985, 2, 2)),
 ('Holgard', 'Pena', datetime.date(1985, 2, 2)),
 ('Limsoon', 'Macedo', datetime.date(1985, 2, 2)),
 ('Jingling', 'Vesna', datetime.date(1985, 2, 2)),
 ('Toney', 'Skrikant', datetime.date(1985, 2, 2)),
 ('Phillip', 'Teitelbaum', datetime.date(1985, 2, 2)),
 ('Gay', 'Kumaresan', datetime.date(1985, 2, 2)),
 ('Xinglin', 'Marakhovsky', datetime.date(1985, 2, 2)),
 ('Keung', 'Peak', datetime.date(1985, 2, 2)),
 ('Chikako', 'Malabarba', datetime.date(1985, 2, 2)),
 ('Nagui', 'DiGiano', datetime.date(1985, 2, 2)),
 ('Zita', 'Vural', datetime.date(1985, 2, 3)),
 ('Nectarios', 'Perna', datetime.date(1985, 2, 3)),
 ('Premsyl', 'Nitto', datetime.date(1985, 2, 3)),
 ('Chiranjit', 'Stemann', datetime.date(1985, 2, 3)),
 ('Fumitaka', 'Boyle', datetime.date(1985, 2, 3)),
 ('Arup', 'Krohm', datetime.date(1985, 2, 3)),
 ('Fumiyo', 'Cronau', datetime.date(1985, 2, 3)),
 ('Aleksander', 'Masaki', datetime.date(1985, 2, 3)),
 ('Godehard', 'Conte', datetime.date(1985, 2, 3)),
 ('Halsur', 'Birrer', datetime.date(1985, 2, 3)),
 ('Huan', 'Dahlbom', datetime.date(1985, 2, 3)),
 ('Shakhar', 'Sgarro', datetime.date(1985, 2, 3)),
 ('Surveyors', 'Badache', datetime.date(1985, 2, 3)),
 ('Mitchel', 'Gustavson', datetime.date(1985, 2, 3)),
 ('Moti', 'Oppitz', datetime.date(1985, 2, 4)),
 ('Arto', 'Argence', datetime.date(1985, 2, 4)),
 ('Lech', 'Linnainmaa', datetime.date(1985, 2, 4)),
 ('Stafford', 'Luce', datetime.date(1985, 2, 4)),
 ('Fox', 'Waschkowski', datetime.date(1985, 2, 4)),
 ('Khalid', 'Salinas', datetime.date(1985, 2, 4)),
 ('Goa', 'Parfitt', datetime.date(1985, 2, 4)),
 ('Eberhardt', 'Pramanik', datetime.date(1985, 2, 4)),
 ('Xiong', 'Chenoweth', datetime.date(1985, 2, 4)),
 ('Tran', 'Jiang', datetime.date(1985, 2, 4)),
 ('Limsoon', 'Bage', datetime.date(1985, 2, 5)),
 ('Boutros', 'Velardi', datetime.date(1985, 2, 5)),
 ('Ohad', 'Srimani', datetime.date(1985, 2, 5)),
 ('Niteen', 'Matteis', datetime.date(1985, 2, 5)),
 ('Vasilis', 'Pettis', datetime.date(1985, 2, 5)),
 ('Berry', 'Dulli', datetime.date(1985, 2, 5)),
 ('Heather', 'Paciorek', datetime.date(1985, 2, 5)),
 ('Jaques', 'Hashii', datetime.date(1985, 2, 5)),
 ('Rance', 'Chepyzhov', datetime.date(1985, 2, 5)),
 ('Goh', 'Linnainmaa', datetime.date(1985, 2, 5)),
 ('Elvia', 'Baalen', datetime.date(1985, 2, 5)),
 ('Goa', 'Swick', datetime.date(1985, 2, 5)),
 ('Ulf', 'Demos', datetime.date(1985, 2, 5)),
 ('Ramalingam', 'Validov', datetime.date(1985, 2, 5)),
 ('Gregory', 'Griswold', datetime.date(1985, 2, 5)),
 ('Mariusz', 'Pokrovskii', datetime.date(1985, 2, 5)),
 ('Shaleah', 'Panwar', datetime.date(1985, 2, 5)),
 ('Amalendu', 'Hiyoshi', datetime.date(1985, 2, 5)),
 ('Chiranjit', 'Ghelli', datetime.date(1985, 2, 5)),
 ('Miyeon', 'Yemenis', datetime.date(1985, 2, 5)),
 ('Bedrich', 'Lubachevsky', datetime.date(1985, 2, 5)),
 ('Ipke', 'Zallocco', datetime.date(1985, 2, 6)),
 ('Elvia', 'Christ', datetime.date(1985, 2, 6)),
 ('Noritoshi', 'Luff', datetime.date(1985, 2, 6)),
 ('Kagan', 'Radhakrishnan', datetime.date(1985, 2, 6)),
 ('Xiaoqiang', 'Ferriere', datetime.date(1985, 2, 6)),
 ('Uriel', 'Daescu', datetime.date(1985, 2, 6)),
 ('Dhritiman', 'Masamoto', datetime.date(1985, 2, 6)),
 ('Sumant', 'Ertl', datetime.date(1985, 2, 6)),
 ('Hugo', 'Griswold', datetime.date(1985, 2, 6)),
 ('Pragnesh', 'Orlowska', datetime.date(1985, 2, 6)),
 ('Ranan', 'Demir', datetime.date(1985, 2, 6)),
 ('Mohua', 'Pocchiola', datetime.date(1985, 2, 6)),
 ('Xianlong', 'Trachtenberg', datetime.date(1985, 2, 6)),
 ('Nakhoon', 'Falby', datetime.date(1985, 2, 6)),
 ('Horward', 'Steenbeek', datetime.date(1985, 2, 6)),
 ('Adil', 'Uludag', datetime.date(1985, 2, 6)),
 ('Aimee', 'Baja', datetime.date(1985, 2, 6))]

In [10]:
join1_test(_)

### 2. How many employees currently work for each department (order from smallest to largest)?

In [14]:
%%sql

select dept_name, count(*) from departments natural join dept_emp
where now() < to_date 
group by (dept_name) order by count

9 rows affected.

[('Finance', 12437),
 ('Human Resources', 12898),
 ('Quality Management', 14546),
 ('Marketing', 14842),
 ('Research', 15441),
 ('Customer Service', 17569),
 ('Sales', 37701),
 ('Production', 53304),
 ('Development', 61386)]

In [15]:
join2_test(_)

Found differences in two results:
But a line by line comparison turned out OK, so you are fine

### 3.  How many employees no longer work for the Research department?

the answer should be a single row and column.

In [24]:
%%sql 

select count(*) from departments natural join dept_emp where dept_name = 'Research' and now() > to_date;

1 rows affected.

[(5685,)]

In [25]:
join3_test(_)

### 4. give the hire date of the last employee hired in each department

In [27]:
%%sql

select dept_name, max(hire_date)
from departments natural join dept_emp natural join employees
group by dept_name

9 rows affected.

[('Research', datetime.date(1999, 12, 10)),
 ('Sales', datetime.date(2000, 1, 4)),
 ('Customer Service', datetime.date(2000, 1, 2)),
 ('Marketing', datetime.date(2000, 1, 4)),
 ('Human Resources', datetime.date(2000, 1, 13)),
 ('Production', datetime.date(2000, 1, 23)),
 ('Quality Management', datetime.date(2000, 1, 28)),
 ('Development', datetime.date(2000, 1, 22)),
 ('Finance', datetime.date(2000, 1, 6))]

In [ ]:
join4_test(_)

### 5. List names of all of the managers and their starting and ending dates who have managed the Customer Service department, order them from first to last.

In [28]:
%%sql 

select first_name, last_name, from_date, to_date from departments natural join dept_manager natural join employees
where dept_name = 'Customer Service'
order by from_date

4 rows affected.

[('Tonny', 'Butterworth', datetime.date(1985, 1, 1), datetime.date(1988, 10, 17)),
 ('Marjo', 'Giarratana', datetime.date(1988, 10, 17), datetime.date(1992, 9, 8)),
 ('Xiaobin', 'Spinelli', datetime.date(1992, 9, 8), datetime.date(1996, 1, 3)),
 ('Yuchang', 'Weedman', datetime.date(1996, 1, 3), datetime.date(9999, 1, 1))]

In [ ]:
join5_test(_)

### 6. Give the first name and last name and salary of the 10 highest paid employees, current

In [32]:
%%sql

select first_name, last_name, salary
from salaries natural join employees
where now() < to_date
order by salary
limit(10)

10 rows affected.

[('Olivera', 'Baek', 38623),
 ('Pascal', 'Lueh', 38936),
 ('Sachar', 'Nicolson', 38942),
 ('Yurij', 'Narwekar', 39012),
 ('Oldrich', 'Schmiedel', 39036),
 ('Gianluca', 'Talmor', 39117),
 ('Marie', 'Marrakchi', 39186),
 ('Xiaopeng', 'Piancastelli', 39227),
 ('Angus', 'Schlumberger', 39264),
 ('Vidar', 'Turnbull', 39285)]

In [ ]:
join6_test(_)

### 7. Give the first name, last name, salary, and title of the 10 highest paid employees, current

In [ ]:
%%sql 

select first_name, last_name, salary, title
from employees natural join salaries join titles 
....

....
...

In [ ]:
join7_test(_)

### 8. Give the  first and last name, salary, and department of the 10 lowest paid employees, current

In [35]:
%%sql

select first_name, last_name, salary, dept_name from employees
natural join dept_emp natural join departments join salaries on employees.emp_no = salaries.emp_no
where now() < salaries.to_date
order by salary
limit(10)

10 rows affected.

[('Olivera', 'Baek', 38623, 'Production'),
 ('Pascal', 'Lueh', 38936, 'Human Resources'),
 ('Sachar', 'Nicolson', 38942, 'Quality Management'),
 ('Yurij', 'Narwekar', 39012, 'Finance'),
 ('Oldrich', 'Schmiedel', 39036, 'Development'),
 ('Gianluca', 'Talmor', 39117, 'Quality Management'),
 ('Marie', 'Marrakchi', 39186, 'Research'),
 ('Xiaopeng', 'Piancastelli', 39227, 'Human Resources'),
 ('Angus', 'Schlumberger', 39264, 'Research'),
 ('Vidar', 'Turnbull', 39285, 'Production')]

In [36]:
join8_test(_)

### 9. What is the average salary of a female in the research department? (All time)

In [ ]:
to_char?

In [ ]:
join9_test(_)

### 10. Show the number of males and females in each department. (All time)

the department names should be sorted and the count of females should be listed before the count of males for each department.

In [40]:
%%sql

select dept_name, gender, count(*)
from departments natural join dept_emp natural join employees
group by dept_name, gender
order by gender

18 rows affected.

[('Research', 'F', 8439),
 ('Customer Service', 'F', 9448),
 ('Marketing', 'F', 8037),
 ('Development', 'F', 34258),
 ('Production', 'F', 29549),
 ('Sales', 'F', 20854),
 ('Human Resources', 'F', 7075),
 ('Quality Management', 'F', 8078),
 ('Finance', 'F', 7015),
 ('Production', 'M', 43936),
 ('Research', 'M', 12687),
 ('Customer Service', 'M', 14132),
 ('Sales', 'M', 31391),
 ('Marketing', 'M', 12174),
 ('Finance', 'M', 10331),
 ('Human Resources', 'M', 10711),
 ('Quality Management', 'M', 12039),
 ('Development', 'M', 51449)]

In [41]:
join10_test(_)

Found differences in two results:
diff in row 5 expected:  dept_name    Finance
gender             M
count          10331
Name: 5, dtype: object
Got:  dept_name    Sales
gender           F
count        20854
Name: 5, dtype: object
diff in row 7 expected:  dept_name    Human Resources
gender                     M
count                  10711
Name: 7, dtype: object
Got:  dept_name    Quality Management
gender                        F
count                      8078
Name: 7, dtype: object
diff in row 10 expected:  dept_name    Production
gender                F
count             29549
Name: 10, dtype: object
Got:  dept_name    Research
gender              M
count           12687
Name: 10, dtype: object
diff in row 12 expected:  dept_name    Quality Management
gender                        F
count                      8078
Name: 12, dtype: object
Got:  dept_name    Sales
gender           M
count        31391
Name: 12, dtype: object
diff in row 14 expected:  dept_name    Research
gender              F
count            8439
Name: 14, dtype: object
Got:  dept_name    Finance
gender             M
count          10331
Name: 14, dtype: object
diff in row 16 expected:  dept_name    Sales
gender           F
count        20854
Name: 16, dtype: object
Got:  dept_name    Quality Management
gender                        M
count                     12039
Name: 16, dtype: object

AssertionError: